str_1 = "четырёхсотпятидесятисемимиллиметровое"
str_2 = "метоксихлордиэтиламинометилбутиламиноакридин"
str_3 = "автомотовелофототелерадиомонтёр"
str_4 = "автоэлектростеклоподъемники"

print(str_1, str_1[0:1:1], str_1[:-2:-1], str_1.count(str_1[0:1:1]) +
      str_1.count(str_1[:-2:-1]))
print(str_2, str_2[0:1:1], str_2[:-2:-1], str_2.count(str_2[0:1:1]) +
      str_2.count(str_2[:-2:-1]))
print(str_3, str_3[0:1:1], str_3[:-2:-1], str_3.count(str_3[0:1:1]) +
      str_3.count(str_3[:-2:-1]))
print(str_4, str_4[0:1:1], str_4[:-2:-1], str_4.count(str_4[0:1:1]) +
      str_4.count(str_4[:-2:-1]))